; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared3 - mode
	thermograph2 - mode
	spectrograph0 - mode
	image1 - mode
	spectrograph4 - mode
	Star0 - direction
	GroundStation1 - direction
	Star3 - direction
	Star4 - direction
	Star5 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	Star9 - direction
	GroundStation10 - direction
	GroundStation11 - direction
	Star2 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph4)
	(supports instrument0 spectrograph0)
	(supports instrument0 thermograph2)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star13)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(have_image Star12 thermograph2)
	(have_image Star13 image1)
	(have_image Star14 spectrograph4)
	(have_image Planet15 image1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite0 star2 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star2)
   goals met: 0 of 5
3. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 5
4. (turn_to satellite0 groundstation1 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 5
5. (turn_to satellite0 planet15 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet15)
   goals met: 0 of 5
6. (take_image satellite0 planet15 instrument0 image1)
   added: (have_image planet15 image1)
   goals met: 1 of 5
7. (turn_to satellite0 groundstation1 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 groundstation1)
   goals met: 2 of 5
8. (turn_to satellite0 star12 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star12)
   goals met: 1 of 5
9. (take_image satellite0 star12 instrument0 thermograph2)
   added: (have_image star12 thermograph2)
   goals met: 2 of 5
10. (turn_to satellite0 groundstation1 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 groundstation1)
   goals met: 3 of 5
11. (turn_to satellite0 star13 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star13)
   goals met: 2 of 5
12. (take_image satellite0 star13 instrument0 image1)
   added: (have_image star13 image1)
   goals met: 3 of 5
13. (turn_to satellite0 groundstation1 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation1)
   goals met: 4 of 5
14. (turn_to satellite0 star14 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star14)
   goals met: 3 of 5
15. (take_image satellite0 star14 instrument0 spectrograph4)
   added: (have_image star14 spectrograph4)
   goals met: 4 of 5
16. (turn_to satellite0 groundstation1 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation1)
   goals met: 5 of 5
